dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.h
#ifndef _LPC17DUINO_H
#define _LPC17DUINO_H

//LPC21duino code
// - using LPC210x: LPC2101/2/3
// - features implemented so far: 
//	- Systick generation via Timer0 overflow
//	- low-power clock gating: peripheral clock disabled on reboot
//	- SystemCoreClock: automatically update SystemCoreClock (=CCLK/F_CPU), and peripheral clock (=PCLK/F_PHB)
//	- GPIO0..5: if available
//	- UART0/1, Timer0..3, External Interrupts0..2
//	- PWM generation on TIMER0..3, Match channel 0..3 - CH3s set periods
//	- ADC and SPI0/SPI1 (SSP) supported
//
// - features to be implemented: I2C
// - 
// - version history
// - v0.1, 8/28/2022: initial implementation, including systick, gpio, uart, and output compare
// - v0.2, 8/29/2022: implemented SystemCoreClockUpdate()
// - v0.3, 9/02/2022: RTC, PWM, ADC and SPI implemented
//
//
//               LPC210x
//              |=====================|
//        Xtal->| 14.7456Mhz      P07 |>---------> LED2
//              |                     |
//              |                 P00 |>---------> U0TX
//              |                 P01 |<---------< U0RX
//              |                     |
//              |                 P08 |>---------> U1TX
//              |                 P09 |<---------< U1RX
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |=====================|
//
//
//	please don't assign other ISRs to those channels (VICIntAddrn)
//	ISR usage: 
//	FIQ: not used
//	Vectored Interrupt:
//	0: unused - WDT
//	1: unused
//	2: unused - ARM Core1
//	3: unused - ARM Core2
//	4: TIMER0
//	5: TIMER1	
//	6: UART0 - reserved	
//	7: UART1 - reserved
//	8: unused
//	9: unused
//	10:unused
//	11:INT0
//	12:INT1
//	13:INT2
//	14:TIMER2
//	15:TIMER3
//
//	Non-vectored interrupt
//	UART0 and UART1
//
// unmapped: I2C0/1, ADC, SPI, IC
//
//

#include <lpc2103.h>						//we use LPC2103.h for LPC2101/2/3
//#include <lpc210x.h>						//we use LPC210x.h for LPC2104/5/6
#include <stdint.h>							//we use uint types
#include <string.h>							//we use strcpy

//hardware configuration
//oscillator configuration
#define F_XTAL				14745600ul		//crystal frequency, user-defined
#define uRAM_SIZE			40				//size of the uram
#define F_SPI0				100000ul		//SPI0 frequency, in Hz
#define F_SPI1				100000ul		//spi1/ssp frequency
#define F_RTC				32768			//rtc crystal
#define F_I2C0				100000ul		//i2c0 clock speed
#define F_I2C1				100000ul		//i2c1 clock speed
//#define USE_FGPIO							//use fast IO. comment out if legacy/"slow" gpio is used
#define USE_U0TXISR							//define to enable uart0 transmission via interrupt
#define USE_U1TXISR							//define to enable uart1 transmission via interrupt

//uart0 pins
#define U0TX_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul << 0)) | (0x01ul << 0);} while (0)	//U0TX to P0.0
//#define U0RX_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul << 2)) | (0x01ul << 2);} while (0)	//U0RX to P0.1
#define U1TX_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<16)) | (0x01ul <<16);} while (0)	//U1TX to P0.8
#define U1RX_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<18)) | (0x01ul <<18);} while (0)	//U1RX to P0.9

#define INT0_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul << 0)) | (0x01ul << 0);} while (0)	//INT0 to P0.16
#define INT1_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<28)) | (0x01ul <<28);} while (0)	//INT1 to P0.14. 1 for LPC2101/2/3, 2 for LPC2104/5/6: why NXP?! 
#define INT2_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<30)) | (0x01ul <<30);} while (0)	//INT2 to P0.15. 1 for LPC2101/2/3, 2 for LPC2104/5/6. why NXP?! 
//#define INT3_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03 << 2)) | (0x01 << 2);} while (0)	//INT3 to P0.1

#define IC00_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul << 4)) | (0x02ul << 4);} while (0)	//CAP0.0 on P0.2
#define IC01_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul << 8)) | (0x02ul << 8);} while (0)	//CAP0.1 on P0.4
#define IC02_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<12)) | (0x02ul <<12);} while (0)	//CAP0.2 on P0.6
//#define IC03_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul << 8)) | (0x02ul << 8);} while (0)	//CAP0.1 on P0.4
#define IC10_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<20)) | (0x02ul <<20);} while (0)	//CAP1.0 on P0.10
#define IC11_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<22)) | (0x02ul <<22);} while (0)	//CAP1.1 on P0.11
#define IC12_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul << 2)) | (0x02ul << 2);} while (0)	//CAP1.2 on P0.17
#define IC13_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul << 4)) | (0x02ul << 4);} while (0)	//CAP1.3 on P0.18
#define IC20_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul <<22)) | (0x02ul <<22);} while (0)	//CAP2.0 on P0.27
#define IC21_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul <<24)) | (0x02ul <<24);} while (0)	//CAP2.1 on P0.28
#define IC22_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul <<26)) | (0x02ul <<26);} while (0)	//CAP2.2 on P0.29
//#define IC23_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul << 4)) | (0x02ul << 4);} while (0)	//CAP1.3 on P0.18
//datasheet notes that CAP3.0..2 not usable on Timer3
//#define IC30_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<20)) | (0x02ul <<20);} while (0)	//CAP1.0 on P0.10
//#define IC31_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<22)) | (0x02ul <<22);} while (0)	//CAP1.1 on P0.11
//#define IC32_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul << 2)) | (0x02ul << 2);} while (0)	//CAP1.2 on P0.17
//#define IC33_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul << 4)) | (0x02ul << 4);} while (0)	//CAP1.3 on P0.18

#define PWM00_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul << 6)) | (0x02ul << 6);} while (0)	//MAT0.0 on P0.3
#define PWM01_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<10)) | (0x02ul <<10);} while (0)	//MAT0.1 on P0.5
#define PWM02_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul << 0)) | (0x02ul << 0);} while (0)	//MAT0.2 on P0.16
//#define PWM03_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul << 6)) | (0x02ul << 6);} while (0)	//MAT0.0 on P0.3

#define PWM10_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<24)) | (0x02ul <<24);} while (0)	//MAT1.0 on P0.12
#define PWM11_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<26)) | (0x02ul <<26);} while (0)	//MAT1.1 on P0.13
#define PWM12_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul << 6)) | (0x02ul << 6);} while (0)	//MAT1.2 on P0.19
#define PWM13_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul << 8)) | (0x02ul << 8);} while (0)	//MAT1.3 on P0.20

#define PWM20_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<14)) | (0x02ul <<14);} while (0)	//MAT2.0 on P0.7
#define PWM21_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<16)) | (0x02ul <<16);} while (0)	//MAT2.1 on P0.8
#define PWM22_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul <<18)) | (0x02ul <<18);} while (0)	//MAT2.2 on P0.9
//#define PWM23_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul << 6)) | (0x02ul << 6);} while (0)	//MAT0.0 on P0.3

#define PWM30_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul <<10)) | (0x02ul <<10);} while (0)	//MAT3.0 on P0.21
#define PWM31_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul << 0)) | (0x02ul << 0);} while (0)	//MAT3.1 on P0.0
#define PWM32_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul << 2)) | (0x02ul << 2);} while (0)	//MAT3.2 on P0.1
#define PWM33_PIN()			do {PINSEL1 = (PINSEL1 &~(0x03ul <<28)) | (0x02ul <<28);} while (0)	//MAT3.3 on P0.30 - as the reset channel


//spi0 pins
#define SCLK0_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul << 8)) | (0x01ul << 8);} while (0)	//sclk0 on P0.4
#define SSEL0_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<14)) | (0x01ul <<14);} while (0)	//ssel0 on P0.7
#define MOSI0_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<12)) | (0x01ul <<12);} while (0)	//mosi0 on P0.6
#define MISO0_PIN()			do {PINSEL0 = (PINSEL0 &~(0x03ul <<10)) | (0x01ul <<10);} while (0)	//miso0 on P0.5
//end user specification

//end pin configuration
extern volatile uint32_t SystemCoreClock;				//system coreclock (=CCLK)
extern volatile uint32_t AHBClock;						//system coreclock (=CCLK)
extern volatile uint32_t APBClock;						//system coreclock (=CCLK)
#define F_PHB				(F_APB)						//((APBDIV & 0x03) == 0)?(F_CPU/4):(((APBDIV & 0x03)== 2)?(F_CPU/2):F_CPU))						//=PCLK. 1/4 CCLK (default).
#define F_CPU				(SystemCoreClock)			//=CCLK
#define F_AHB				(AHBClock)
#define F_APB				(APBClock)

#define PWM_PR				0xffff						//pwm period - don't change

//port manipulation macros for PIC.
//MODE:
//Output modes: GPIOMODE_OUTPP, GPIOMODE_OUTOD
//Input mode: GPIOMODE_INPUT, GPIOMODE_INPUTP3, GPIOMODE_INPUTPU
//Alternate function: GPIOMODE_AFPP, GPIOMODE_AFOD
//for moder
#define GPIOMODE_INPUT		(0<<0)		//(0<<0)
#define GPIOMODE_OUTPUT		(1<<0)		//(1<<0)
#define GPIOMODE_AF			(2<<0)
#define GPIOMODE_AN			(3<<0)
//for otyper
#define GPIOMODE_PP			(1<<3)
#define GPIOMODE_OD			(0<<3)
//for puP3r
#define GPIOMODE_FL			(0<<4)
#define GPIOMODE_PU			(1<<4)
#define GPIOMODE_P3			(2<<4)

//AF defs
#define GPIOMODE_AF0		0
#define GPIOMODE_AF1		1
#define GPIOMODE_AF2		2
#define GPIOMODE_AF3		3
#define GPIOMODE_AF4		4
#define GPIOMODE_AF5		5
#define GPIOMODE_AF6		6
#define GPIOMODE_AF7		7

#define GPIOMODE_OUTPP		(GPIOMODE_OUTPUT | GPIOMODE_PP)		//gpio, output, push-pull
#define GPIOMODE_OUTOD		(GPIOMODE_OUTPUT | GPIOMODE_OD)		//gpio, output, od
#define GPIOMODE_INFL		(GPIOMODE_INPUT)
#define GPIOMODE_INPU		(GPIOMODE_INPUT | GPIOMODE_PU)
#define GPIOMODE_INP3		(GPIOMODE_INPUT | GPIOMODE_P3)
#define GPIOMODE_AFPP		(GPIOMODE_AF | GPIOMODE_PP)
#define GPIOMODE_AFOD		(GPIOMODE_AF | GPIOMODE_OD)
#define GPIOMODE_INAN		(GPIOMODE_AN)

//global variables

