dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.h
//port macros
#define IO_SET(port, pins)	port->SET = (pins)	//port->PIN |= (pins)	//port->ODR |= (pins)		//port->BSRR = (pins)
#define IO_CLR(port, pins)	port->CLR = (pins)	//port->PIN &=~(pins)	//port->BRR = (pins)
#define IO_FLP(port, pins)	port->PIN^= (pins)	//flip an output pin
#define IO_GET(port, pins)	((port->PIN) & (pins))	//return gpio pins

//fast gpio routines
//#define FIO_SET(port, pins)	port->MASKED_ACCESS[pins] = (pins)	//IO_SET(port, pins)		//port->BSRR = (pins)
//#define FIO_CLR(port, pins)	port->MASKED_ACCESS[pins] = 0		//IO_CLR(port, pins)		//port->BRR = (pins)
//#define FIO_FLP(port, pins)	IO_FLP(port, pins)		//no fast io routine for pin flipping
//#define FIO_GET(port, pins) (port->MASKED_ACCESS[pins] & (pins))	//IO_GET(port, pins)		// no fast io routines

//set pins to output
//void IO_OUT(GPIO_TypeDef* port, uint16_t pins);
#define IO_OUT(port, pins)	port->DIR |= (pins)		//GPIO_SetDir(port, pins, 1)

//set pins as floating input
//void IO_IN(GPIO_TypeDef* port, uint16_t pins);
#define IO_IN(port, pins)	port->DIR &=~(pins)		//GPIO_SetDir(port, pins, 0)

#define NOP()				Nop()                           //asm("nop")					//nop()
#define NOP2()				{NOP(); NOP();}
#define NOP4()				{NOP2(); NOP2();}
#define NOP8()				{NOP4(); NOP4();}
#define NOP16()				{NOP8(); NOP8();}
#define NOP16()				{NOP8(); NOP8();}
#define NOP24()				{NOP16(); NOP8();}
#define NOP32()				{NOP16(); NOP16();}
#define NOP40()				{NOP32(); NOP8();}
#define NOP64()				{NOP32(); NOP32();}

#define sleep()				asm("sleep")					//put the mcu into sleep

#ifndef ei
#define ei()				//asm volatile ("ei")				//__builtin_enable_interrupts()	//do {INTEnableInterrupts();	INTEnableSystemMultiVectoredInt();} while (0)	//__builtin_enable_interrupts()
#endif

#ifndef di
#define di()				//asm volatile ("di")				//__builtin_enable_interrupts()	//INTDisableInterrupts()			//__builtin_disable_interrupts()	//
#endif


//simple multiples
#define x1(val)				(val)								//multiply val by 1
#define x2(val)				(((val) << 1))						//multiply val by 2
#define x3(val)				(x2(val) + (val))					//multiply val by 3
#define x4(val)				(((val) << 2))						//multiply val by 4
#define x5(val)				(x4(val) + (val))					//multiply val by 5
#define x6(val)				(x4(val) + x2(val))					//multiply val by 6
#define x7(val)				(x6(val) + (val))					//multiply val by 7
#define x8(val)				((val) << 3)						//multiply val by 8
#define x9(val)				(x8(val) + (val))					//multiply val by 9

//multiples of 10s
#define x10(val)			(x8(val) + x2(val))					//multiply val by 10
#define x100(val)			(x10(x10(val)))						//multiply val by 100
#define x1000(val)			(x100(x10(val)))					//multiply val by 1000
#define x1k(val)			x1000(val)							//multiply val by 1000
#define x10k(val)			(x100(x100(val)))					//multiply val by 10000

#define x20(val)			(x2(x10(val)))
#define x30(val)			(x3(x10(val)))
#define x40(val)			(x4(x10(val)))
#define x50(val)			(x5(x10(val)))
#define x60(val)			(x6(x10(val)))
#define x70(val)			(x7(x10(val)))
#define x80(val)			(x8(x10(val)))
#define x90(val)			(x9(x10(val)))

//multiples of 100s
#define x200(val)			(x2(x100(val)))
#define x300(val)			(x3(x100(val)))
#define x400(val)			(x4(x100(val)))
#define x500(val)			(x5(x100(val)))
#define x600(val)			(x6(x100(val)))
#define x700(val)			(x7(x100(val)))
#define x800(val)			(x8(x100(val)))
#define x900(val)			(x9(x100(val)))

//custom definitions
#define x34(val)			(x30(val) + x4(val))				//multiply val by 34
#define x97(val)			(x90(val) + x7(val))				//multiply val by 97x

//port structure

//global defines
//if user decides to use faster gpio and it exists on the chip
#if defined(USE_FGPIO) & defined(FIODIR)
//for fast gpio
typedef struct {
	uint32_t DIR;	   		//output direction register. offset:0xc000
	uint32_t reserved[3];	//stuffy
	uint32_t MASK;			//fiomask. offset: 0xc010
	uint32_t PIN;			//input data register. offset: 0xc014
	uint32_t SET;			//output set register. offset: 0xc018
	uint32_t CLR;		   	//output clear register. offset: 0xc01c
} LPC_GPIO_TypeDef;

#if defined(FIODIR) | defined(FIODIR0)
#define LPC_GPIO0			((LPC_GPIO_TypeDef *) &FIODIR)
#endif

#if defined(FIODIR1)
#define LPC_GPIO1			((LPC_GPIO_TypeDef *) &FIODIR1)
#endif

#if defined(FIODIR2)
#define LPC_GPIO2			((LPC_GPIO_TypeDef *) &FIODIR2)
#endif

#if defined(FIODIR3)
#define LPC_GPIO3			((LPC_GPIO_TypeDef *) &FIODIR3)
#endif

#if defined(FIODIR4)
#define LPC_GPIO4			((LPC_GPIO_TypeDef *) &FIODIR4)
#endif

#if defined(FIODIR5)
#define LPC_GPIO5			((LPC_GPIO_TypeDef *) &FIODIR5)
#endif

#else
//for legacy / slow gpio
typedef struct {
	uint32_t PIN;			//input data register
	uint32_t SET;			//output set register
	uint32_t DIR;	   		//output direction register
	uint32_t CLR;		   	//output clear register
} LPC_GPIO_TypeDef;

#if defined(IOPIN) | defined(IOPIN0)
#define LPC_GPIO0			((LPC_GPIO_TypeDef *) &IOPIN)
#endif

#if defined(IOPIN1)
#define LPC_GPIO1			((LPC_GPIO_TypeDef *) &IOPIN1)
#endif

#if defined(IOPIN2)
#define LPC_GPIO2			((LPC_GPIO_TypeDef *) &IOPIN2)
#endif

#if defined(IOPIN3)
#define LPC_GPIO3			((LPC_GPIO_TypeDef *) &IOPIN3)
#endif

#if defined(IOPIN4)
#define LPC_GPIO4			((LPC_GPIO_TypeDef *) &IOPIN4)
#endif

#if defined(IOPIN5)
#define LPC_GPIO5			((LPC_GPIO_TypeDef *) &IOPIN5)
#endif

#endif	//USE_FGPIO

//pin enum - matches GPIO_PinDef[]
//ports are 32 bits
typedef enum {
#if defined(LPC_GPIO0)
	P00,  P01,  P02,  P03,  P04,  P05,  P06,  P07,  P08,  P09,  P010, P011, P012, P013, P014, P015,
	P016, P017, P018, P019, P020, P021, P022, P023, P024, P025, P026, P027, P028, P029, P030, P031,
#endif
#if defined(LPC_GPIO1)
	P10,  P11,  P12,  P13,  P14,  P15,  P16,  P17,  P18,  P19,  P110, P111, P112, P113, P114, P115,
	P116, P117, P118, P119, P120, P121, P122, P123, P124, P125, P126, P127, P128, P129, P130, P131,
#endif
#if defined(LPC_GPIO2)
	P20,  P21,  P22,  P23,  P24,  P25,  P26,  P27,  P28,  P29,  P210, P211, P212, P213, P214, P215,
	P216, P217, P218, P219, P220, P221, P222, P223, P224, P225, P226, P227, P228, P229, P230, P231,
#endif		//GPIOC
#if defined(LPC_GPIO3)
	P30,  P31,  P32,  P33,  P34,  P35,  P36,  P37,  P38,  P39,  P310, P311, P312, P313, P314, P315,
	P316, P317, P318, P319, P320, P321, P322, P323, P324, P325, P326, P327, P328, P329, P330, P331,
#endif		//GPIOC
#if defined(LPC_GPIO4)
	P40,  P41,  P42,  P43,  P44,  P45,  P46,  P47,  P48,  P49,  P410, P411, P412, P413, P414, P415,
	P416, P417, P418, P419, P420, P421, P422, P423, P424, P425, P426, P427, P428, P429, P430, P431,
#endif		//GPIOC
#if defined(LPC_GPIO5)
	P50,  P51,  P52,  P53,  P54,  P55,  P56,  P57,  P58,  P59,  P510, P511, P512, P513, P514, P515,
	P516, P517, P518, P519, P520, P521, P522, P523, P524, P525, P526, P527, P528, P529, P530, P531,
#endif		//GPIOC
	PMAX
} PIN_TypeDef;

//map pin number to GPIOx
typedef struct {
	LPC_GPIO_TypeDef *gpio;				//gpio for a pin
	uint32_t mask;						//pin mask - 32-bit port
} PIN2GPIO;
	
#define INPUT				0
#define OUTPUT				1			//(!INPUT)
#define INPUT_PULLUP		2

