dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.h
#define LOW					0
#define HIGH				(!LOW)

#define PI 					3.1415926535897932384626433832795
#define HALF_PI 			(PI / 2)							//1.5707963267948966192313216916398
#define TWO_PI 				(PI + PI)							//6.283185307179586476925286766559
#define DEG_TO_RAD 			(TWO_PI / 360)						//0.017453292519943295769236907684886
#define RAD_TO_DEG 			(360 / TWO_PI)						//57.295779513082320876798154814105
#define EULER 				2.718281828459045235360287471352	//Euler's number

#define SERIAL  			0x0
#define DISPLAY 			0x1

#define LSBFIRST 			0
#define MSBFIRST 			1									//(!LSBFIRST)							//1

#define CHANGE 				1
#define FALLING 			2
#define RISING 				3

#ifndef min
#define min(a,b) 			((a)<(b)?(a):(b))
#endif
#ifndef max
#define max(a,b) 			((a)>(b)?(a):(b))
#endif
#define abs(x) 				((x)>0?(x):-(x))
#define constrain(amt,low,high) ((amt)<(low)?(low):((amt)>(high)?(high):(amt)))
#define round(x)     		((x)>=0?(long)((x)+0.5):(long)((x)-0.5))
#define radians(deg) 		((deg)*DEG_TO_RAD)
#define degrees(rad) 		((rad)*RAD_TO_DEG)
#define sq(x) 				((x)*(x))

#define interrupts() 		ei()
#define noInterrupts() 		di()

#define clockCyclesPerMillisecond() 	( F_CPU / 1000L )
#define clockCyclesPerMicrosecond() 	( F_CPU / 1000000L )
#define clockCyclesToMicroseconds(a) 	( (a) / clockCyclesPerMicrosecond() )
#define microsecondsToClockCycles(a) 	( (a) * clockCyclesPerMicrosecond() )

#define lowByte(w) 			((uint8_t) ((w) & 0xff))
#define highByte(w) 		((uint8_t) ((w) >> 8))

#define bitRead(value, bit) (((value) >> (bit)) & 0x01)
#define bitSet(value, bit) 	((value) |= (1UL << (bit)))
#define bitClear(value, bit) ((value) &= ~(1UL << (bit)))
#define bitWrite(value, bit, bitvalue) (bitvalue ? bitSet(value, bit) : bitClear(value, bit))
#define bit(n)				(1ul<<(n))

#define false				0
#define true				(!false)

//characters
#define isAlphaNumeric(c)	isalnum(c)
#define isAlpha(c)			isalpha(c)
#define isAscii(c)			isascii(c)
#define isWhitespace(c)		isblank(c)
#define isControl(c)		iscntrl(c)
#define isDigit(c)			isdigit(c)
#define isGraph(c)			isgraph(c)
#define isLowerCase(c)		islower(c)
#define isPrintable(c)		isprint(c)
#define isPunct(c)			ispunct(c)
#define isSpace(c)			isspace(c)
#define isUpperCase(c)		isupper(c)
#define isHexadecimalDigit(c)	isxdigit(c)

//external setup/loop - defined by user
extern void setup(void);
extern void loop(void);

//random number
#define randomSeed(seed)	srand(seed)
#define random(max)			random2(0, max)
#define random2(min, max)	((min) + (int32_t) ((max) - (min)) * rand() / 32768)

//GPIO
void pinMode(PIN_TypeDef pin, uint8_t mode);
void digitalWrite(PIN_TypeDef pin, uint8_t mode);
int digitalRead(PIN_TypeDef pin);

//time base
//uint32_t ticks(void);								//timer ticks from timer2
#define systicks()			(T0TC)					//T0TC as systick generator
#define coreticks()			systicks()			  	//for compatibility
#define ticks()				systicks()				//for compatibility
#define millis()			(ticks() / cyclesPerMillisecond())
#define micros()			(ticks() / cyclesPerMicrosecond())
//void delay(uint32_t ms);							//delay a given number of ms
//void delayMicroseconds(uint32_t us);				//delay a given number of us
void delayTks(uint32_t tks);						//delay a given number of ticks
#define delayMicroseconds(us)			delayTks((us) * cyclesPerMicrosecond())
#define delayMilliseconds(ms)			delayTks((ms) * cyclesPerMillisecond())
#define delay(ms)						delayMilliseconds(ms)
#define cyclesPerMicrosecond()			(F_CPU / 1000000ul)
#define cyclesPerMillisecond()			(F_CPU / 1000)

//advanced IO
//void tone(void);									//tone frequency specified by F_TONE in STM8Sduino.h
//void noTone(void);
//shiftin/out: bitOrder = MSBFIRST or LSBFIRST
uint8_t shiftIn(PIN_TypeDef dataPin, PIN_TypeDef clockPin, uint8_t bitOrder);
void shiftOut(PIN_TypeDef dataPin, PIN_TypeDef clockPin, uint8_t bitOrder, uint8_t val);
uint32_t pulseIn(PIN_TypeDef pin, uint8_t state);		//wait for a pulse and return timing

//pwm output
void analogWriteInit(PIN_TypeDef pin);					//initialize analog write output
void analogWrite(PIN_TypeDef pin, uint32_t dc);			//generate output

//analog read on ADC1
//read DRL first for right aligned results
uint16_t analogRead(PIN_TypeDef pin);

//analog reference - default to AVdd-AVss
//Vref sources: 0->Vref = AVdd-AVss, 1->Vref+-AVss, 2->AVdd-Vref-, 3->Vref+ - Vref-
//void analogReference(uint8_t Vref);

//interrupts
//install external interrupt handler
//mode 1: falling edge, 0: rising edge
//void attachInterrupt(uint8_t intx, void (*isrptr) (void), uint8_t mode);
//void detachInterrupt(uint8_t intx);

//change notification interrupts
//install user CN interrupt handler
//void attachCNInterrupt(void (*isrptr) (void));
//void detachCNInterrupt(void);
//void activateCNInterrupt(uint8_t cnx, uint8_t pue);
//void deactivateCNInterrupt(uint8_t cnx);

//global variables

//reset the mcu
void mcuInit(void);

//empty interrupt handler
void empty_handler(void);

//timer0
void tmr0Init(void);					//initializer tmr0
#define tmr0SetPS(ps)	T0PR = (ps) - 1	//set the prescaler
#define tmr0GetPS()		(T0PR+1)		//get the prescaler
#define tmr0PWMInit()	do {tmr0Init(); tmr0SetPS(1); tmr0PWM3Init(); tmr0PWMSetPR(PWM_PR);} while (0)	//initialize tmr3 pwm, using channel 3 as reset
#define tmr0PWMSetPR(pr)	tmr0PWM3SetDC(pr)
#define tmr0PWMGetPR()		tmr0PWM3GetDC()

void tmr0OC0SetPR(uint32_t pr);			//initialize timer0/match channel 0 period
uint32_t tmr0OC0GetPR(void);				//read timer period
void tmr0OC0AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr0
void tmr0IC0AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic0
#define tmr0IC0Get()	(T0CR0)			//return the captured value
void tmr0PWM0Init(void);				//initialize pwm
#define tmr0PWM0SetDC(dc)	T0MR0 =-(dc)	//set duty cycle
#define tmr0PWM0GetDC()		((uint32_t) -T0MR0)		//get duty cycle

void tmr0OC1SetPR(uint32_t pr);			//initialize timer0/match channel 1 period
uint32_t tmr0OC1GetPR(void);				//read timer period
void tmr0OC1AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr1
void tmr0IC1AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic1
#define tmr0IC1Get()	(T0CR1)			//return the captured value
void tmr0PWM1Init(void);				//initialize pwm
#define tmr0PWM1SetDC(dc)	T0MR1 =-(dc)	//set duty cycle
#define tmr0PWM1GetDC()		((uint32_t) -T0MR1)		//get duty cycle

void tmr0OC2SetPR(uint32_t pr);			//initialize timer0/match channel 2 period
uint32_t tmr0OC2GetPR(void);				//read timer period
void tmr0OC2AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr2
void tmr0IC2AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic2
#define tmr0IC2Get()	(T0CR2)			//return the captured value
void tmr0PWM2Init(void);				//initialize pwm
#define tmr0PWM2SetDC(dc)	T0MR2 =-(dc)	//set duty cycle
#define tmr0PWM2GetDC()		((uint32_t) -T0MR2)		//get duty cycle

void tmr0OC3SetPR(uint32_t pr);			//initialize timer0/match channel 3 period
uint32_t tmr0OC3GetPR(void);				//read timer period
void tmr0OC3AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr3
void tmr0IC3AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic3
#define tmr0IC3Get()	(T0CR3)			//return the captured value
void tmr0PWM3Init(void);				//initialize pwm
#define tmr0PWM3SetDC(dc)	T0MR3 =(dc)	//set duty cycle
#define tmr0PWM3GetDC()		((uint32_t) T0MR3)		//get duty cycle

//timer1
void tmr1Init(void);					//initializer tmr0
#define tmr1SetPS(ps)	T1PR = (ps) - 1	//set the prescaler
#define tmr1GetPS()		(T1PR+1)		//get the prescaler
#define tmr1PWMInit()	do {tmr1Init(); tmr1SetPS(1); tmr1PWM3Init(); tmr1PWMSetPR(PWM_PR);} while (0)	//initialize tmr3 pwm, using channel 3 as reset
#define tmr1PWMSetPR(pr)	tmr1PWM3SetDC(pr)
#define tmr1PWMGetPR()		tmr1PWM3GetDC()

void tmr1OC0SetPR(uint32_t pr);			//initialize timer0/match channel 0 period
uint32_t tmr1OC0GetPR(void);				//read timer period
void tmr1OC0AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr0
void tmr1IC0AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic0
#define tmr1IC0Get()	(T1CR0)			//return the captured value
void tmr1PWM0Init(void);				//initialize pwm
#define tmr1PWM0SetDC(dc)	T1MR0 =-(dc)	//set duty cycle
#define tmr1PWM0GetDC()		((uint32_t)-T1MR0)		//get duty cycle

void tmr1OC1SetPR(uint32_t pr);			//initialize timer0/match channel 1 period
uint32_t tmr1OC1GetPR(void);				//read timer period
void tmr1OC1AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr1
void tmr1IC1AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic1
#define tmr1IC1Get()	(T1CR1)			//return the captured value
void tmr1PWM1Init(void);				//initialize pwm
#define tmr1PWM1SetDC(dc)	T1MR1 =-(dc)	//set duty cycle
#define tmr1PWM1GetDC()		((uint32_t)-T1MR1)		//get duty cycle

void tmr1OC2SetPR(uint32_t pr);			//initialize timer0/match channel 2 period
uint32_t tmr1OC2GetPR(void);				//read timer period
void tmr1OC2AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr2
void tmr1IC2AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic2
#define tmr1IC2Get()	(T1CR2)			//return the captured value
void tmr1PWM2Init(void);				//initialize pwm
#define tmr1PWM2SetDC(dc)	T1MR2 =-(dc)	//set duty cycle
#define tmr1PWM2GetDC()		((uint32_t)-T1MR2)		//get duty cycle

void tmr1OC3SetPR(uint32_t pr);			//initialize timer0/match channel 3 period
uint32_t tmr1OC3GetPR(void);				//read timer period
void tmr1OC3AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr3
void tmr1IC3AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic3
#define tmr1IC3Get()	(T1CR3)			//return the captured value
void tmr1PWM3Init(void);				//initialize pwm
#define tmr1PWM3SetDC(dc)	T1MR3 = (dc)	//set duty cycle
#define tmr1PWM3GetDC()		((uint32_t) T1MR3)		//get duty cycle


