dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.h
//timer2
void tmr2Init(void);					//initializer tmr0
#define tmr2SetPS(ps)	T2PR = (ps) - 1	//set the prescaler
#define tmr2GetPS()		(T2PR+1)		//get the prescaler
#define tmr2PWMInit()	do {tmr2Init(); tmr2SetPS(1); tmr2PWM3Init(); tmr2PWMSetPR(PWM_PR);} while (0)	//initialize tmr3 pwm, using channel 3 as reset
#define tmr2PWMSetPR(pr)	tmr2PWM3SetDC(pr)
#define tmr2PWMGetPR()		tmr2PWM3GetDC()

void tmr2OC0SetPR(uint32_t pr);			//initialize timer0/match channel 0 period
uint32_t tmr2OC0GetPR(void);				//read timer period
void tmr2OC0AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr0
void tmr2IC0AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic0
#define tmr2IC0Get()	(T2CR0)			//return the captured value
void tmr2PWM0Init(void);				//initialize pwm
#define tmr2PWM0SetDC(dc)	T2MR0 =-(dc)	//set duty cycle
#define tmr2PWM0GetDC()		((uint32_t) -T2MR0)		//get duty cycle

void tmr2OC1SetPR(uint32_t pr);			//initialize timer0/match channel 1 period
uint32_t tmr2OC1GetPR(void);				//read timer period
void tmr2OC1AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr1
void tmr2IC1AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic0
#define tmr2IC1Get()	(T2CR1)			//return the captured value
void tmr2PWM1Init(void);				//initialize pwm
#define tmr2PWM1SetDC(dc)	T2MR1 =-(dc)	//set duty cycle
#define tmr2PWM1GetDC()		((uint32_t) -T2MR1)		//get duty cycle

void tmr2OC2SetPR(uint32_t pr);			//initialize timer0/match channel 2 period
uint32_t tmr2OC2GetPR(void);				//read timer period
void tmr2OC2AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr2
void tmr2IC2AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic0
#define tmr2IC2Get()	(T2CR2)			//return the captured value
void tmr2PWM2Init(void);				//initialize pwm
#define tmr2PWM2SetDC(dc)	T2MR2 =-(dc)	//set duty cycle
#define tmr2PWM2GetDC()		((uint32_t) -T2MR2)		//get duty cycle

void tmr2OC3SetPR(uint32_t pr);			//initialize timer0/match channel 3 period
uint32_t tmr2OC3GetPR(void);				//read timer period
void tmr2OC3AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr3
void tmr2IC3AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic0
#define tmr2IC3Get()	(T2CR3)			//return the captured value
void tmr2PWM3Init(void);				//initialize pwm
#define tmr2PWM3SetDC(dc)	T2MR3 = (dc)	//set duty cycle
#define tmr2PWM3GetDC()		((uint16_t) T2MR3)		//get duty cycle


//timer3
void tmr3Init(void);					//initializer tmr0
#define tmr3SetPS(ps)	T3PR = (ps) - 1	//set the prescaler
#define tmr3GetPS()		(T3PR+1)		//get the prescaler
#define tmr3PWMInit()	do {tmr3Init(); tmr3SetPS(1); tmr3PWM3Init(); tmr3PWMSetPR(PWM_PR);} while (0)	//initialize tmr3 pwm, using channel 3 as reset
#define tmr3PWMSetPR(pr)	tmr3PWM3SetDC(pr)
#define tmr3PWMGetPR()		tmr3PWM3GetDC()

void tmr3OC0SetPR(uint32_t pr);			//initialize timer0/match channel 0 period
uint32_t tmr3OC0GetPR(void);				//read timer period
void tmr3OC0AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr0
void tmr3IC0AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic0
#define tmr3IC0Get()	(T3CR0)			//return the captured value
void tmr3PWM0Init(void);				//initialize pwm
#define tmr3PWM0SetDC(dc)	T3MR0 =-(dc)	//set duty cycle - pin reset to low and set on match
#define tmr3PWM0GetDC()		((uint16_t) -T3MR0)		//get duty cycle

void tmr3OC1SetPR(uint32_t pr);			//initialize timer0/match channel 1 period
uint32_t tmr3OC1GetPR(void);				//read timer period
void tmr3OC1AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr1
void tmr3IC1AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic0
#define tmr3IC1Get()	(T3CR1)			//return the captured value
void tmr3PWM1Init(void);				//initialize pwm
#define tmr3PWM1SetDC(dc)	T3MR1 =-(dc)	//set duty cycle - pin reset to low and set on match
#define tmr3PWM1GetDC()		((uint16_t) -T3MR1)		//get duty cycle

void tmr3OC2SetPR(uint32_t pr);			//initialize timer0/match channel 2 period
uint32_t tmr3OC2GetPR(void);				//read timer period
void tmr3OC2AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr2
void tmr3IC2AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic0
#define tmr3IC2Get()	(T3CR2)			//return the captured value
void tmr3PWM2Init(void);				//initialize pwm
#define tmr3PWM2SetDC(dc)	T3MR2 =-(dc)	//set duty cycle - pin reset to low and set on match
#define tmr3PWM2GetDC()		((uint16_t) -T3MR2)		//get duty cycle

void tmr3OC3SetPR(uint32_t pr);			//initialize timer0/match channel 3 period
uint32_t tmr3OC3GetPR(void);				//read timer period
void tmr3OC3AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/mr3
void tmr3IC3AttachISR(void (*isr_ptr)(void));	//install user isr for timer0/ic0
#define tmr3IC3Get()	(T3CR3)			//return the captured value
void tmr3PWM3Init(void);				//initialize pwm
#define tmr3PWM3SetDC(dc)	T3MR3 =(dc)	//set duty cycle - pin reset to low and set on match
#define tmr3PWM3GetDC()		((uint16_t) T3MR3)		//get duty cycle


//#define Mhz					000000ul	//suffix for Mhz
#define F_UART				(F_PHB)	//8Mhz		//crystal frequency
#define UART_BR300			300ul		//buadrate=300
#define UART_BR600			600ul		//buadrate=600
#define UART_BR1200			1200ul		//buadrate=1200
#define UART_BR2400			2400ul		//buadrate=2400
#define UART_BR4800			4800ul		//buadrate=4800
#define UART_BR9600			9600ul		//buadrate=9600
#define UART_BR19200		19200ul		//buadrate=19200
#define UART_BR38400		38400ul		//buadrate=38400
#define UART_BR57600		57600ul		//buadrate=57600
#define UART_BR115200		115200ul	//buadrate=115200

//for uart0
//for compatability
#define uart0Put(ch)		uart0Putch(ch)
#define uart0Get()			uart0Getch()

//initiate the hardware usart
void uart0Init(uint32_t baud_rate);
void uart0Putch(char ch);
void uart0Puts(char *str);
//uint16_t uart0Available(void);
#define uart0Available()	(U0LSR & (1<<0))
//uint16_t uart0Busy(void);
#define uart0Busy()			((U0LSR & (1<<6)) == 0)		//5->tx buffer empty, 6->transmission ends
#define uart0Wait()			while (uart0Busy())

void uart0Putline(char *ln);
//read a char from usart
//uint8_t uart0Getch(void);
#define uart0Getch()		(U0RBR)
void u0Print(char *str, int32_t dat);					//print a string on uart01
#define u0Println()			uart0Puts("\r\n")	//print a return on uart01

//for uart1
//for compatability
#define uart1Put(ch)		uart1Putch(ch)
#define uart1Get()			uart1Getch()

//initiate the hardware usart
void uart1Init(uint32_t baud_rate);
void uart1Putch(char ch);
void uart1Puts(char *str);
//uint16_t uart0Available(void);
#define uart1Available()	(U1LSR & (1<<0))
//uint16_t uart0Busy(void);
#define uart1Busy()			((U1LSR & (1<<6))==0)		//5->tx buffer empty, 6->transmission ends
#define uart1Wait()			while (uart1Busy())

void uart1Putline(char *ln);
//read a char from usart
//uint8_t uart0Getch(void);
#define uart1Getch()		(U1RBR)
void u1Print(char *str, int32_t dat);					//print a string on uart01
#define u1Println()			uart1Puts("\r\n")	//print a return on uart01

//end Serial

//spi0
void spi0Init(void);			//initialize the spi transmission
uint8_t spi0Write(uint8_t dat);	//send spi transmision
#define spi0Read()			spi0Write(0x00)
#define spi0Available()		(!spi0Busy())	  	//1->spi transmission has ended
#define spi0Busy()			((S0SPSR & (1<<7))==0)		//1->spi transmision in progress
//end spi0

//spi1/ssp
void spi1Init(void);			//initialize the spi transmission
uint8_t spi1Write(uint8_t dat);	//send spi transmision
#define spi1Read()			spi1Write(0x00)
#define spi1Available()		(SSPSR & (1<<2))	  	//1->receiving buffer is not empty
#define spi1Busy()			((SSPSR & (1<<1))==0)	//1->buffer is full, 0->buffer is not full so you write to it.
//end spi1/ssp

//rtc
void rtcInit(void);				//reset rtc to use low speed crystal (F_RTC)
void rtcInit2PCLK(void);		//reset rtc to use PCLK
#define rtcSEC()			(SEC)
#define rtcMIN()			(MIN)
#define rtcHOUR()			(HOUR)
#define rtcDOW()			(DOW)
#define rtcDOM()			(DOM)
#define rtcDOY()			(DOY)
#define rtcMON()			(MON)
#define rtcYEAR()			(YEAR)

//end rtc


