dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.h
//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm1Init(uint16_t TxCCP_PS);

//set duty cycle
#define pwm1SetDC1(dc)		TIM1->CCR1 = (dc)
#define pwm1SetDC2(dc)		TIM1->CCR2 = (dc)
#define pwm1SetDC3(dc)		TIM1->CCR3 = (dc)
#define pwm1SetDC4(dc)		TIM1->CCR4 = (dc)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm3Init(uint16_t TxCCP_PS);

//set duty cycle
#define pwm3SetDC1(dc)			TIM3->CCR1 = (dc)
#define pwm3SetDC2(dc)			TIM3->CCR2 = (dc)
#define pwm3SetDC3(dc)			TIM3->CCR3 = (dc)
#define pwm3SetDC4(dc)			TIM3->CCR4 = (dc)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm14Init(uint16_t TxCCP_PS);
//set duty cycle
#define pwm14SetDC1(dc)			TIM14->CCR1 = (dc)
#define pwm14SetDC2(dc)			TIM14->CCR2 = (dc)
#define pwm14SetDC3(dc)			TIM14->CCR3 = (dc)
#define pwm14SetDC4(dc)			TIM14->CCR4 = (dc)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm15Init(uint16_t TxCCP_PS);
//set duty cycle
#define pwm15SetDC1(dc)			TIM15->CCR1 = (dc)
#define pwm15SetDC2(dc)			TIM15->CCR2 = (dc)
#define pwm15SetDC3(dc)			TIM15->CCR3 = (dc)
#define pwm15SetDC4(dc)			TIM15->CCR4 = (dc)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm16Init(uint16_t TxCCP_PS);
//set duty cycle
#define pwm16SetDC1(dc)			TIM16->CCR1 = (dc)
#define pwm16SetDC2(dc)			TIM16->CCR2 = (dc)
#define pwm16SetDC3(dc)			TIM16->CCR3 = (dc)
#define pwm16SetDC4(dc)			TIM16->CCR4 = (dc)

//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm17Init(uint16_t TxCCP_PS);
//set duty cycle
#define pwm17SetDC1(dc)			TIM17->CCR1 = (dc)
#define pwm17SetDC2(dc)			TIM17->CCR2 = (dc)
#define pwm17SetDC3(dc)			TIM17->CCR3 = (dc)
#define pwm17SetDC4(dc)			TIM17->CCR4 = (dc)

//adc
//adc channel definitions
#define ADC_CH0			(1ul<<0)
#define ADC_CH1			(1ul<<1)
#define ADC_CH2			(1ul<<2)
#define ADC_CH3			(1ul<<3)
#define ADC_CH4			(1ul<<4)
#define ADC_CH5			(1ul<<5)
#define ADC_CH6			(1ul<<6)
#define ADC_CH7			(1ul<<7)

//convert temperature sensor adc reading into temperaturex10
//follow the datasheet. 3.3v Vref (3.0v for my board), 12bit adc
#define Tx10(adc)		(3529 - ((uint32_t) (3300*10*10/43 * (adc)) >> 12))

//rest the adc
//automatic sampling (ASAM=1), manual conversion
void adcInit(void);
uint16_t adcRead(uint8_t ch);

//read the adc
uint16_t analogRead(PIN_TypeDef pin);
//end ADC


//input capture
//16-bit mode, rising edge, single capture, Timer2 as timebase
//interrupt disabled
void ic1Init(void);
void ic1AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic1Get(void);							//read buffer value

void ic2Init(void);
void ic2AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic2Get(void);							//read buffer value

void ic3Init(void);
void ic3AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic3Get(void);							//read buffer value

void ic4Init(void);
void ic4AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic4Get(void);							//read buffer value

void ic5Init(void);
void ic5AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic5Get(void);							//read buffer value
//end input capture

//int - level sensitive
void int0Init(int intEdge);							//initialize the module
void int0AttachISR(void (*isrptr) (void));		//attach user isr

void int1Init(int intEdge);							//initialize the module
void int1AttachISR(void (*isrptr) (void));		//attach user isr

void int2Init(int intEdge);							//initialize the module
void int2AttachISR(void (*isrptr) (void));		//attach user isr

void int3Init(int intEdge);							//initialize the module - not implemented
void int3AttachISR(void (*isrptr) (void));		//attach user isr

void int4Init(int intEdge);							//initialize the module - not implemented
void int4AttachISR(void (*isrptr) (void));		//attach user isr
//end int

//spi

//end spi

//i2c
//end i2c

//rtcc
//end rtcc

//extint
//pin: one pin only
//gpio: GPIOA..GPIOG
void extiInit(LPC_GPIO_TypeDef * gpio, uint16_t pin, uint8_t edge);
void extiAttachISR(uint16_t pin, void (*isr_ptr)(void));		//install user handler
//end extint


#endif
